# FieldValues Constructor (IList(VectorAtPoint))

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldValues Constructor (IList<(Of <(<'VectorAtPoint>)>)>)
FieldValues Class See Also
---
Creates object from an array of domain point vectors
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FieldValues(
	IList<VectorAtPoint> vectorAtPoint
)
```

Visual Basic
---
```text
Public Sub New ( _
	vectorAtPoint As IList(Of VectorAtPoint) _
)
```

Visual C++
---
```text
public:
FieldValues(
	IList<VectorAtPoint^>^ vectorAtPoint
)
```

# ### Parameters
vectorAtPoint
    Type: System.Collections.Generic..::..IList<(Of <(<'VectorAtPoint>)>)> Array of vectors, each corresponding to a domain point
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Members of vectorAtPoint contain different numbers of measurements |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FieldValues Class
FieldValues Overload
Autodesk.Revit.DB.Analysis Namespace